---
kind: property
id: P:Autodesk.Revit.DB.Visual.Metal.MetalPerforationsCenter
source: html/590a66c3-7387-f7d9-c826-68e0f8a673dc.htm
---
# Autodesk.Revit.DB.Visual.Metal.MetalPerforationsCenter Property

The property labeled "Center Spacing" from the "Metal" schema.

## Syntax (C#)
```csharp
public static string MetalPerforationsCenter { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" with a minimum of "0.0001".